---
title: MeshFromGeometryOperationResult
classe: Autodesk.Revit.DB.MeshFromGeometryOperationResult
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 7
---

# MeshFromGeometryOperationResult

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Boolean HasInvalidData { get; }` | `meshFromGeometryOperationResult.HasInvalidData` | Boolean |
| `Boolean IsMeshAvailable { get; }` | `meshFromGeometryOperationResult.IsMeshAvailable` | Boolean |
| `Boolean IsValidObject { get; }` | `meshFromGeometryOperationResult.IsValidObject` | Boolean |
| `Boolean Tessellated { get; }` | `meshFromGeometryOperationResult.Tessellated` | Boolean |
| `Void Dispose()` | `meshFromGeometryOperationResult.Dispose()` | Void |
| `IList<MeshFromGeometryOperationIssue> GetIssues()` | `meshFromGeometryOperationResult.GetIssues()` | IList<MeshFromGeometryOperationIssue> |
| `Mesh GetMesh()` | `meshFromGeometryOperationResult.GetMesh()` | Mesh |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```